# Taps
tap "nikitabobko/tap"
tap "FelixKratz/formulae"

# Core tools
brew "git"
brew "neovim"
brew "tmux"
brew "lazygit"

# Search & file utilities
brew "ripgrep"
brew "fd"
brew "tree-sitter"

# Fun CLI tools
brew "figlet"
brew "jp2a"

# Language support
brew "lua"
brew "node"
brew "pyenv"

# Sketchybar
brew "FelixKratz/formulae/sketchybar"

# Casks
cask "wezterm"
cask "nikitabobko/tap/aerospace"

# Fonts
cask "font-meslo-lg-nerd-font"
cask "font-hack-nerd-font"
